var industryData = [
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1000,
              "id": 1010,
              "name": "研究和试验发展"
          },
          {
              "level": 2,
              "pid": 1000,
              "id": 1011,
              "name": "专业技术服务业"
          },
          {
              "level": 2,
              "pid": 1000,
              "id": 1012,
              "name": "科技推广和应用服务业"
          }
      ],
      "id": 1000,
      "name": "科学研究和技术服务业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1100,
              "id": 1110,
              "name": "互联网和相关服务"
          },
          {
              "level": 2,
              "pid": 1100,
              "id": 1111,
              "name": "软件和信息技术服务业"
          },
          {
              "level": 2,
              "pid": 1100,
              "id": 1112,
              "name": "电信、广播电视和卫星传输服务"
          }
      ],
      "id": 1100,
      "name": "信息传输、软件和信息技术服务业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1200,
              "id": 1210,
              "name": "专用设备制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1211,
              "name": "汽车制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1212,
              "name": "金属制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1213,
              "name": "通用设备制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1214,
              "name": "计算机、通信和其他电子设备制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1215,
              "name": "铁路、船舶、航空航天和其他运输设备制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1216,
              "name": "电气机械和器材制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1217,
              "name": "金属制品、机械和设备修理业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1218,
              "name": "废弃资源综合利用业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1219,
              "name": "木材加工和木、竹、藤、棕、草制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1220,
              "name": "仪器仪表制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1221,
              "name": "造纸和纸制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1222,
              "name": "印刷和记录媒介复制业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1223,
              "name": "文教、工美、体育和娱乐用品制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1224,
              "name": "石油加工、炼焦和核燃料加工业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1225,
              "name": "化学原料和化学制品制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1226,
              "name": "医药制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1227,
              "name": "化学纤维制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1228,
              "name": "橡胶和塑料制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1229,
              "name": "非金属矿物制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1230,
              "name": "有色金属冶炼和压延加工业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1231,
              "name": "黑色金属冶炼和压延加工业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1232,
              "name": "皮革、毛皮、羽毛及其制品和制鞋业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1233,
              "name": "纺织业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1234,
              "name": "纺织服装、服饰业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1235,
              "name": "酒、饮料和精制茶制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1236,
              "name": "烟草制品业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1237,
              "name": "农副食品加工业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1238,
              "name": "食品制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1239,
              "name": "家具制造业"
          },
          {
              "level": 2,
              "pid": 1200,
              "id": 1240,
              "name": "其他制造业"
          }
      ],
      "id": 1200,
      "name": "制造业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1300,
              "id": 1310,
              "name": "开采辅助活动"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1311,
              "name": "非金属矿采选业"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1312,
              "name": "黑色金属矿采选业"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1313,
              "name": "有色金属矿采选业"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1314,
              "name": "煤炭开采和洗选业"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1315,
              "name": "石油和天然气开采业"
          },
          {
              "level": 2,
              "pid": 1300,
              "id": 1316,
              "name": "其他采矿业"
          }
      ],
      "id": 1300,
      "name": "采矿业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1400,
              "id": 1410,
              "name": "渔业"
          },
          {
              "level": 2,
              "pid": 1400,
              "id": 1411,
              "name": "农、林、牧、渔服务业"
          },
          {
              "level": 2,
              "pid": 1400,
              "id": 1412,
              "name": "农业"
          },
          {
              "level": 2,
              "pid": 1400,
              "id": 1413,
              "name": "林业"
          },
          {
              "level": 2,
              "pid": 1400,
              "id": 1414,
              "name": "畜牧业"
          }
      ],
      "id": 1400,
      "name": "农、林、牧、渔业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1500,
              "id": 1510,
              "name": "建筑安装业"
          },
          {
              "level": 2,
              "pid": 1500,
              "id": 1511,
              "name": "土木工程建筑业"
          },
          {
              "level": 2,
              "pid": 1500,
              "id": 1512,
              "name": "房屋建筑业"
          },
          {
              "level": 2,
              "pid": 1500,
              "id": 1513,
              "name": "建筑装饰和其他建筑业"
          }
      ],
      "id": 1500,
      "name": "建筑业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1600,
              "id": 1610,
              "name": "燃气生产和供应业"
          },
          {
              "level": 2,
              "pid": 1600,
              "id": 1611,
              "name": "电力、热力生产和供应业"
          },
          {
              "level": 2,
              "pid": 1600,
              "id": 1612,
              "name": "水的生产和供应业"
          }
      ],
      "id": 1600,
      "name": "电力、热力、燃气及水生产和供应业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1700,
              "id": 1710,
              "name": "公共设施管理业"
          },
          {
              "level": 2,
              "pid": 1700,
              "id": 1711,
              "name": "生态保护和环境治理业"
          },
          {
              "level": 2,
              "pid": 1700,
              "id": 1712,
              "name": "水利管理业"
          }
      ],
      "id": 1700,
      "name": "水利、环境和公共设施管理业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1800,
              "id": 1810,
              "name": "仓储业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1811,
              "name": "装卸搬运和运输代理业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1812,
              "name": "管道运输业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1813,
              "name": "航空运输业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1814,
              "name": "水上运输业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1815,
              "name": "邮政业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1816,
              "name": "铁路运输业"
          },
          {
              "level": 2,
              "pid": 1800,
              "id": 1817,
              "name": "道路运输业"
          }
      ],
      "id": 1800,
      "name": "交通运输、仓储和邮政业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 1900,
              "id": 1910,
              "name": "资本市场服务"
          },
          {
              "level": 2,
              "pid": 1900,
              "id": 1911,
              "name": "货币金融服务"
          },
          {
              "level": 2,
              "pid": 1900,
              "id": 1912,
              "name": "保险业"
          },
          {
              "level": 2,
              "pid": 1900,
              "id": 1913,
              "name": "其他金融业"
          }
      ],
      "id": 1900,
      "name": "金融业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2000,
              "id": 2010,
              "name": "租赁业"
          },
          {
              "level": 2,
              "pid": 2000,
              "id": 2011,
              "name": "商务服务业"
          }
      ],
      "id": 2000,
      "name": "租赁和商务服务业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2100,
              "id": 2110,
              "name": "房地产业"
          }
      ],
      "id": 2100,
      "name": "房地产业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2200,
              "id": 2210,
              "name": "批发业"
          },
          {
              "level": 2,
              "pid": 2200,
              "id": 2211,
              "name": "零售业"
          }
      ],
      "id": 2200,
      "name": "批发和零售业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2300,
              "id": 2310,
              "name": "居民服务业"
          },
          {
              "level": 2,
              "pid": 2300,
              "id": 2311,
              "name": "机动车、电子产品和日用产品修理业"
          },
          {
              "level": 2,
              "pid": 2300,
              "id": 2312,
              "name": "其他服务业"
          }
      ],
      "id": 2300,
      "name": "居民服务、修理和其他服务业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2400,
              "id": 2410,
              "name": "餐饮业"
          },
          {
              "level": 2,
              "pid": 2400,
              "id": 2411,
              "name": "住宿业"
          }
      ],
      "id": 2400,
      "name": "住宿和餐饮业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2500,
              "id": 2510,
              "name": "体育"
          },
          {
              "level": 2,
              "pid": 2500,
              "id": 2511,
              "name": "娱乐业"
          },
          {
              "level": 2,
              "pid": 2500,
              "id": 2512,
              "name": "广播、电视、电影和影视录音制作业"
          },
          {
              "level": 2,
              "pid": 2500,
              "id": 2513,
              "name": "文化艺术业"
          },
          {
              "level": 2,
              "pid": 2500,
              "id": 2514,
              "name": "新闻和出版业"
          }
      ],
      "id": 2500,
      "name": "文化、体育和娱乐业"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2600,
              "id": 2610,
              "name": "教育"
          }
      ],
      "id": 2600,
      "name": "教育"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2700,
              "id": 2710,
              "name": "卫生"
          },
          {
              "level": 2,
              "pid": 2700,
              "id": 2711,
              "name": "社会工作"
          }
      ],
      "id": 2700,
      "name": "卫生和社会工作"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2800,
              "id": 2810,
              "name": "基层群众自治组织"
          },
          {
              "level": 2,
              "pid": 2800,
              "id": 2811,
              "name": "群众团体、社会团体和其他成员组织"
          },
          {
              "level": 2,
              "pid": 2800,
              "id": 2812,
              "name": "社会保障"
          },
          {
              "level": 2,
              "pid": 2800,
              "id": 2813,
              "name": "人民政协、民主党派"
          },
          {
              "level": 2,
              "pid": 2800,
              "id": 2814,
              "name": "国家机构"
          },
          {
              "level": 2,
              "pid": 2800,
              "id": 2815,
              "name": "中国共产党机关"
          }
      ],
      "id": 2800,
      "name": "公共管理、社会保障和社会组织"
  },
  {
      "level": 1,
      "children": [
          {
              "level": 2,
              "pid": 2900,
              "id": 2910,
              "name": "国际组织"
          }
      ],
      "id": 2900,
      "name": "国际组织"
  }
]
define(function(require, factory) {
    return industryData
});